
#ifdef _CODEMAPDEF
#else
#define _CODEMAPDEF

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define CODEMAP_NOTFOUND (-1)
#define CODEMAP_MAXINDEX (0x100)

/* #define CODEMAP_DEBUG */

/**** CodeMap CodeMapStruct ****/
typedef struct {
  int ****map;
} CodeMapStruct, *CodeMap;

/*
******************************************************************************************
CodeMap_create
文字コードマッピングテーブル作成
******************************************************************************************
*/
CodeMap CodeMap_create();

/*
******************************************************************************************
CodeMap_delete
文字コードマッピングテーブル削除
******************************************************************************************
*/
void CodeMap_delete(CodeMap cmap);

/*
******************************************************************************************
CodeMap_set
文字コードマッピングに値を設定
******************************************************************************************
*/
void CodeMap_set(CodeMap cmap, int idx, int val);

/*
******************************************************************************************
CodeMap_get
文字コードマッピングの値を取得
******************************************************************************************
*/
int CodeMap_get(CodeMap cmap, int idx);

/*
******************************************************************************************
CodeMap_showCount
文字コードマッピングのカウント値を表示する
******************************************************************************************
*/
void CodeMap_showCount();

#endif

